# 최우선 연산자 #
print(10 + 2 * 3)
# 10 + 6
print((10 + 2) * 3)
# 12 * 3

# 단항연산자 #

# 부호 표시
print(-3.14) # 음수
print(+2.33) # 양수

# 산술연산자 #

# 1) +
print(10 + 2) # 12
print(3.12 + 4) # 7.12

# 2) -
print(30 - 10) # 20
print(5.55 - 2) # 3.55

# 3) *
print(2 * 8) # 16
print(3.3 * 2) # 6.6

# 4) / => 항상 float로 나옴
print(10 / 2) # 5.0
print(8 / 4) # 2.0

# 5) // => 몫 연산자
print(10 // 3) # 3, 10을 3으로 나눈 몫
print(8 // 5) # 1, 8을 5로 나눈 몫

# 6) % => 나머지 연산자
print(10 % 3) # 1, 10을 3으로 나눈 나머지
print(8 % 5) # 3, 8을 5로 나눈 나머지

# 7) ** => 거듭제곱 연산자
print(5 ** 3) # 5 * 5 * 5
